In [1]:
import pandas as pd
data = [10, 20, 30, 40]
v = pd.Series(data)
print(v)

0    10
1    20
2    30
3    40
dtype: int64

In [53]:
data = {
'Name': ['Alice', 'Bob', 'Charlie'],
'Age': [25, 30, None],
'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print(df)

df[["Name" , "City"]]

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2  Charlie   NaN      Chicago

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

In [54]:
fdata=df[df["Age"] > 30] 
print(fdata)


df['Age'].fillna(df['Age'].mean(), inplace=True)

print(df)

Empty DataFrame
Columns: [Name, Age, City]
Index: []
      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2  Charlie  27.5      Chicago

In [16]:
import pandas as pd
df = pd.read_csv('/home/user/ML LAB/transactions.csv')

In [17]:
df.head()

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1

In [18]:
df.tail()

   TransactionID TransactionDate  UserID  ProductID  Quantity
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   TransactionID    10 non-null     int64
 1   TransactionDate  10 non-null     object
 2   UserID           9 non-null      float64
 3   ProductID        10 non-null     int64
 4   Quantity         10 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 532.0+ bytes

In [20]:
df

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [21]:
df.describe()

       TransactionID    UserID  ProductID   Quantity
count       10.00000  9.000000  10.000000  10.000000
mean         5.50000  3.444444   3.400000   2.400000
std          3.02765  2.127858   1.074968   1.712698
min          1.00000  1.000000   2.000000   1.000000
25%          3.25000  2.000000   2.250000   1.000000
50%          5.50000  3.000000   4.000000   2.000000
75%          7.75000  3.000000   4.000000   3.000000
max         10.00000  7.000000   5.000000   6.000000

In [22]:
df["UserID"]

0    7.0
1    3.0
2    3.0
3    1.0
4    2.0
5    2.0
6    3.0
7    NaN
8    7.0
9    3.0
Name: UserID, dtype: float64

In [23]:
df["Quantity"]

0    1
1    1
2    1
3    3
4    1
5    6
6    1
7    3
8    3
9    4
Name: Quantity, dtype: int64

In [24]:
df.iloc[1]

TransactionID               2
TransactionDate    2011-05-26
UserID                    3.0
ProductID                   4
Quantity                    1
Name: 1, dtype: object

In [40]:
import pandas as pd
df = pd.read_csv("transactions.csv")
df.rename(columns={"Quantity": "Quant"}, inplace=True)
print(df.head())

   TransactionID TransactionDate  UserID  ProductID  Quant
0              1      2010-08-21     7.0          2      1
1              2      2011-05-26     3.0          4      1
2              3      2011-06-16     3.0          3      1
3              4      2012-08-26     1.0          2      3
4              5      2013-06-06     2.0          4      1

In [41]:
print(df.isnull().sum())

TransactionID      0
TransactionDate    0
UserID             1
ProductID          0
Quant              0
dtype: int64

In [56]:
import pandas as pd
df = pd.read_csv("transactions.csv")
df_sorted = df.sort_values(by=["Quantity", "TransactionDate"],
ascending=[True, False])
print(df_sorted)

   TransactionID TransactionDate  UserID  ProductID  Quantity
6              7      2013-12-30     3.0          4         1
4              5      2013-06-06     2.0          4         1
2              3      2011-06-16     3.0          3         1
1              2      2011-05-26     3.0          4         1
0              1      2010-08-21     7.0          2         1
8              9      2015-04-24     7.0          4         3
7              8      2014-04-24     NaN          2         3
3              4      2012-08-26     1.0          2         3
9             10      2016-05-08     3.0          4         4
5              6      2013-12-23     2.0          5         6

In [57]:
subset = df[df['Quantity'] > 1]
print(subset)

   TransactionID TransactionDate  UserID  ProductID  Quantity
3              4      2012-08-26     1.0          2         3
5              6      2013-12-23     2.0          5         6
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [58]:
subset_rows = df.iloc[[0, 2, 5]]
print(subset_rows)

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
2              3      2011-06-16     3.0          3         1
5              6      2013-12-23     2.0          5         6

In [59]:
subset_rows = df.iloc[[0, 2, 5]]
print(subset_rows)

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
2              3      2011-06-16     3.0          3         1
5              6      2013-12-23     2.0          5         6

In [62]:
data = {
'Name': ['Alice', 'Bob', 'Charlie'],
'Age': [25, 30, None],
'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

foo = [True, False, True] # Example of a boolean array
subset_rows = df[foo]
print(subset_rows)

      Name   Age      City
0    Alice  25.0  New York
2  Charlie   NaN   Chicago

# Subset by columns TransactionID and TransactionDate with
logical operator

In [64]:
import pandas as pd
df = pd.read_csv("transactions.csv")

subset = df[df['Quantity'] > 1][['TransactionID', 'TransactionDate']]
print(subset)

   TransactionID TransactionDate
3              4      2012-08-26
5              6      2013-12-23
7              8      2014-04-24
8              9      2015-04-24
9             10      2016-05-08

# Subset columns by a variable list of column names

In [65]:
columns_to_select = ['TransactionID', 'TransactionDate']
subset_columns = df[columns_to_select]
print(subset_columns)

   TransactionID TransactionDate
0              1      2010-08-21
1              2      2011-05-26
2              3      2011-06-16
3              4      2012-08-26
4              5      2013-06-06
5              6      2013-12-23
6              7      2013-12-30
7              8      2014-04-24
8              9      2015-04-24
9             10      2016-05-08

# Subset columns excluding a variable list of column names
Code:

In [66]:

columns_to_exclude = ['Quantity', 'ProductID']
subset_columns_excluded = df[[col for col in df.columns if col not
in columns_to_exclude]]
print(subset_columns_excluded)

   TransactionID TransactionDate  UserID
0              1      2010-08-21     7.0
1              2      2011-05-26     3.0
2              3      2011-06-16     3.0
3              4      2012-08-26     1.0
4              5      2013-06-06     2.0
5              6      2013-12-23     2.0
6              7      2013-12-30     3.0
7              8      2014-04-24     NaN
8              9      2015-04-24     7.0
9             10      2016-05-08     3.0

# Convert the TransactionDate column to type Date

In [70]:

df['TransactionDate'] = pd.to_datetime(df['TransactionDate'])
print(df.dtypes)

TransactionID               int64
TransactionDate    datetime64[ns]
UserID                    float64
ProductID                   int64
Quantity                    int64
dtype: object

# Insert a new column, Foo = UserID + ProductID

In [71]:
df['Foo'] = df['UserID'] + df['ProductID']
print(df.head())

   TransactionID TransactionDate  UserID  ProductID  Quantity  Foo
0              1      2010-08-21     7.0          2         1  9.0
1              2      2011-05-26     3.0          4         1  7.0
2              3      2011-06-16     3.0          3         1  6.0
3              4      2012-08-26     1.0          2         3  3.0
4              5      2013-06-06     2.0          4         1  6.0

# Inserting a New Row

In [75]:
df.loc[len(df)] = [6, "2013-07-07" , 3.3 , 5 , 2 , 7.0]
print(df)

    TransactionID      TransactionDate  UserID  ProductID  Quantity   Foo
0               1  2010-08-21 00:00:00     7.0          2         1   9.0
1               2  2011-05-26 00:00:00     3.0          4         1   7.0
2               3  2011-06-16 00:00:00     3.0          3         1   6.0
3               4  2012-08-26 00:00:00     1.0          2         3   3.0
4               5  2013-06-06 00:00:00     2.0          4         1   6.0
5               6  2013-12-23 00:00:00     2.0          5         6   7.0
6               7  2013-12-30 00:00:00     3.0          4         1   7.0
7               8  2014-04-24 00:00:00     NaN          2         3   NaN
8               9  2015-04-24 00:00:00     7.0          4         3  11.0
9              10  2016-05-08 00:00:00     3.0          4         4   7.0
10              6           2013-07-07     3.3          5         2   7.0
11              6           2013-07-07     3.3          5         2   7.0

# Updating Existing Values
Code:

In [77]:

df.loc[df['UserID'] == 2, 'Quantity'] = 4  # new quantity value
df

    TransactionID      TransactionDate  UserID  ProductID  Quantity   Foo
0               1  2010-08-21 00:00:00     7.0          2         1   9.0
1               2  2011-05-26 00:00:00     3.0          4         1   7.0
2               3  2011-06-16 00:00:00     3.0          3         1   6.0
3               4  2012-08-26 00:00:00     1.0          2         3   3.0
4               5  2013-06-06 00:00:00     2.0          4         4   6.0
5               6  2013-12-23 00:00:00     2.0          5         4   7.0
6               7  2013-12-30 00:00:00     3.0          4         1   7.0
7               8  2014-04-24 00:00:00     NaN          2         3   NaN
8               9  2015-04-24 00:00:00     7.0          4         3  11.0
9              10  2016-05-08 00:00:00     3.0          4         4   7.0
10              6           2013-07-07     3.3          5         2   7.0
11              6           2013-07-07     3.3          5         2   7.0